[
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1A",
        "Benchmark": "Compare the natural world and human-made world",
        "Benchmark Detail": "The natural world includes trees, plants, animals, rivers, oceans, mountains, and other items that make up the earth's landscape, biomes, and climate. The human-made world includes pencils, rulers, computers, buildings, airplanes, roads, refrigerators, communication devices, and other items developed forthe betterment of humans.",
        "NGSS (2013)": "K-2-ETS1-1 Ask questions based on observations to find more information about the natural and/or designed world(s).",
        "CCSS Math": "K.MD.2. Directly compare two objects with a measurable attribute in common, to see which object has more of/less of the attribute, and describe the difference.",
        "CCSS ELA": "ELA-Literacy.SL.K.3 Ask and answer questions in order to seek help, get information, or clarify something that is not understood.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1B",
        "Benchmark": "Explain the tools and techniques that people use to help them do things",
        "Benchmark Detail": "By using technology and engineering, people adapt the natural world to meet their needs and wants and to solve problems. All people use tools and processes created through technology and engineering in every aspect of their daily tasks.",
        "NGSS (2013)": "ETS1.B Designs can be conveyed through sketches, drawings, or physical models. These representations are useful in communicating ideas for a problem’s solutions to other people.",
        "CCSS Math": "1.MD.4 Organize, represent, and interpret data with up to three categories; ask and answer questions about the total number of data points.",
        "CCSS ELA": "ELA-Literacy.L.K.5.a Sort common objects into categories (e.g., shapes, foods) to gain a sense of the concepts the categories represent.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1C",
        "Benchmark": "Demonstrate that creating can be done by anyone",
        "Benchmark Detail": "Using technology and engineering tools and techniques, anyone can design or improve things to enhance their lives. Creation of new knowledge, approaches, and inventions can occur through either individual or collaborative efforts. Even young children can view themselves as creators",
        "NGSS (2013)": "ETS1.A A situation that people want to change or create can be approached as a problem to be solved through engineering.",
        "CCSS Math": "K.G.5. Model shapes in the world by building shapes from components (e.g., sticks and clay balls) and drawing shapes.",
        "CCSS ELA": "ELA-Literacy.W.K.2 Use a combination of drawing, dictating, and writing to compose informative/explanatory texts in which they name what they are writing about and supply some information about the topic.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1D",
        "Benchmark": "Discuss the roles of scientists, engineers, technologists and others who work with technology",
        "Benchmark Detail": "Technological advancement does not occur without the teamwork of many people who have knowledge and skills in distinct areas. Being able to recognize the unique contributions of these individuals is a necessary part of the technological and engineering design process. Young children can develop an appreciation of how people with different specialties can collaborate to design, create, build, and test a product or system. Analogies often work well with students in this grade band. For example, they can understand how a vehicle is purchased from a dealer, maintained by a mechanic at a service center, and driven by a family member. All of these people have something to do with the vehicle, but each in their own way.",
        "NGSS (2013)": "ETS1.A, ETS1-1 – Asking questions, making observations, and gathering information are helpful in thinking about problems",
        "CCSS Math": "1.MD.4 Organize, represent, and interpret data with up to three categories; ask and answer questions about the total number of data points",
        "CCSS ELA": "ELA-Literacy L2.5a Identify real-life connections between words and their use (e.g., describe foods that are spicy or juicy).",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1E",
        "Benchmark": "Compare how things found in nature differ from things that are human-made, noting differences and similarities in how they are produced and used",
        "Benchmark Detail": "For example, the essentials for natural plant growth are sunshine (photosynthesis), air, water, and nutrients; whereas human-made items require an idea, resources (e.g., time, money, materials, and machines), and techniques. Things found in nature, such as trees, birds, and wildflowers, require no human intervention. On the other hand, creating human-made products, such as shoes, requires human effort and innovation.",
        "NGSS (2013)": "5-ps1-3 Make observations to identify materials based on their properties.",
        "CCSS Math": "5.G.4 Classify two-dimensional figures in a hierarchy based on properties.",
        "CCSS ELA": "ELA-Literacy.W.3.7 Conduct short research projects that build knowledge about a topic",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1F",
        "Benchmark": "Describe the unique relationship between science and technology, and how the natural world can contribute to the human-made world to foster innovation",
        "Benchmark Detail": "People have, from the beginning, looked around to identify and use the materials and resources available to improve their lives. Raw materials and resources are shaped into tools, systems, and forms of energy to provide people with products that satisfy a need or want. Energy is harnessed to provide power and heat, and animals and crops are raised for food and clothing. These and other processes continue today as people use raw materials to create items they want and need.",
        "NGSS (2013)": "5-ESS3-1 Obtain and combine information about ways individual communities use science ideas to protect the earth's resources and environment.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.3.3 Describe the relationship between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text, using language that pertains to time, sequence, and cause/effect.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1G",
        "Benchmark": "Differentiate between the role of scientists, engineers, technologists and others in creating and maintaining technological systems",
        "Benchmark Detail": "The roles of scientists, engineers, and technologists are interrelated, yet each contributes a unique area of expertise to every endeavor. Students should be able to identify how individuals with different areas of contentknowledge inform the creation of technology, and why this collaboration is important.",
        "NGSS (2013)": "3-5-ETS1-2 At whatever stages, communicating with peers about proposed solutions is an important part of the design process, and shared ideas can lead to improved designs.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.W.5.7 Conduct short research projects that use several sources to build knowledge through investigation of different aspects of a topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1H",
        "Benchmark": "Design solutions by safely using tools, materials, and skills",
        "Benchmark Detail": "People use appropriate tools and skills to help them do their work (e.g., a carpenter uses a hammer to build a house; a doctor uses diagnostic imaging machines to treat patients). People also use resources, such as metal, wood, cloth, and stone, to make things they use every day.",
        "NGSS (2013)": "ETS1.C Different solutions need to be tested in order to determine which of them best solves the problem, given the criteria and the constraints.",
        "CCSS Math": "",
        "CCSS ELA": "",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1I",
        "Benchmark": "Explain how solutions to problems are shaped by economic, political and cultural forces",
        "Benchmark Detail": "For example, the interests, desires, and financial resources of a group of peoplewill influence the type of transportation system developed for that community. A transportation system for a large city may rely on mass transit, while one in a smaller town might rely onpersonal vehicles.",
        "NGSS (2013)": "3-5-ETS1-2 Research on a problem should be carried out before beginning to design a solution.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.4.3 Explain events, procedures, ideas, or concepts in a historical, scientific, or technical text, including what happened and why, based on specific information in the text.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1J",
        "Benchmark": "Develop innovative objects and systems that solve problems and extend capabilities based on individual or collective needs and wants",
        "Benchmark Detail": "For example, the news is fullof stories about young innovators such as Marie Elena Grimmett, who at age 14 developed a system for using recyclable plastic beads to filter out a harmful antibiotic used to treat livestock and commonly found in water supplies in rural areas. This development process entails the important step of problem finding, which often results from needs or wants that students have identified in their own lives or the lives of family members.",
        "NGSS (2013)": "MS-ETS1-4. Develop a model to generate data for iterative testing and modification of a proposed object, tool, or process such that an optimal design can be achieved. ",
        "CCSS Math": "7.G.1 Solve problems involving scale drawings of geometric figures, including computing actual lengths and areas from a scale drawing and reproducing a scale drawing at a different scale.",
        "CCSS ELA": "ELA-Literacy.W.7.7 Conduct short research projects to answer a question, drawing on several sources and generating additional related, focused questions for further research and investigation.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1K",
        "Benchmark": "Compare and contrast the contributions of science, engineering, and technologists in the development of technological systems",
        "Benchmark Detail": "Students at this level can discern the contributions the fields of science, engineering, mathematics, and technology (as well as other disciplines) contribute to the advancement of technological tools and systems. One way this can be accomplished is by conducting case studies of specific technologies and learning more about their history",
        "NGSS (2013)": "MS-ETS1-3. Analyze data from tests to determine similarities and differences among several design solutions to identify the best characteristics of each that can be combined into a new solution to better meet the criteria for success.",
        "CCSS Math": "7.SP.7 Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy.",
        "CCSS ELA": "ELA-Literacy.RI.6.7 Integrate information presented in different media or formats (e.g., visually, quantitatively) as well as in words to develop a coherent understanding of a topic or issue.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1L",
        "Benchmark": "Explain how technology and engineering are closely linked to creativity, which can result in both intended and unintended innovations",
        "Benchmark Detail": "Creativity requires an individual to use knowledge and experience from different subjects to create something new or to use something in a new way. Many inventions are inspired by perceived needs and wants, the toothbrush, for example. Other inventions emerge in unexpected ways. For example, Stephanie Kwolek was working to find a replacement for steel cords in tires when she inadvertently invented Kevlar. Creatively exploring new ideas is often key to improvement of technological products and systems.",
        "NGSS (2013)": "MS-ETS1-4 Sometimes parts of different solutions can be combined to create a solution that is better than any of its predecessors.",
        "CCSS Math": "",
        "CCSS ELA": "",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1M",
        "Benchmark": "Apply creative problem-solving strategies to the improvement of existing devices or processes or the development of new approaches",
        "Benchmark Detail": "Design and problem solving are seen as iterative processes that involve idea generating, making or building possible solutions, testing, and redesign. Creative problem solving allows for new insights that lead to improvements such as greater efficiency, better performance, lower environmental impacts, and so on. For example, students learning about aerodynamics might devise modifications to a model rocket design to make it more streamlined and accurate.",
        "NGSS (2013)": "MS-ETS1-3 Analyze data from tests to determine similarities and differences among several design solutions to identify the best characteristics of each that can be combined into a new solution to better meet the criteria for success.",
        "CCSS Math": "7.EE.3 Solve multi-step real-life and mathematical problems posed with positive and negative rational numbers in any form (whole numbers, fractions, and decimals), using tools strategically.",
        "CCSS ELA": "ELA-Literacy.SL.7.2 Analyze the main ideas and supporting details presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how the ideas clarify a topic, text, or issue under study",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1N",
        "Benchmark": "Explain how the world around them guides technological development and engineering design",
        "Benchmark Detail": "Technological developments are best achieved through experiences and interactions within a given context. For example, design of buildings should take into account local conditions including soil type, wind, and snow loads, and should also match local building codes and building styles.",
        "NGSS (2013)": "HS-ETS1-1 Analyze a major global challenge to specify qualitative and quantitative criteria and constraints for solutions that account for societal need and wants.",
        "CCSS Math": "N-Q.1 Use units as a way to understand problems and to guide the solution of multi?step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays.",
        "CCSS ELA": "ELA-Literacy.RST.9-10.2 Determine the central ideas or conclusions of a text; trace the text's explanation or depiction of a complex process, phenomenon, or concept; provide an accurate summary of the text.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1O",
        "Benchmark": "Assess how similarities and differences among scientific, mathematics, engineering, and technological knowledge and skills contributed to the design of a product or system",
        "Benchmark Detail": "Developing and improving products or systems require scientific, engineering, and technical expertise. Articulating how knowledge and skills from each contributed or will contribute to a product or system is a necessary component of innovation and design.",
        "NGSS (2013)": "HS-ETS1-2. Criteria may need to be broken down into simpler ones that can be approached systematically, and decisions about the priority of certain criteria over others (trade-offs) may be needed",
        "CCSS Math": "S-IC.6 Evaluate reports based on data",
        "CCSS ELA": "E13ELA-Literacy.RST.9-10.9 Compare and contrast findings presented in a text to those from other sources (including their own experiments), noting when the findings support or contradict previous explanations or accounts.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1P",
        "Benchmark": "Analyze the rate of technological development and predict future diffusion and adoption of new technologies",
        "Benchmark Detail": "The rate of development of inventions and innovations is affected by many factors, such as time and monetary investment. Many new technologies build upon previous technologies, often resulting in quick development and dispersion. For example, the rapid development of consumer-scale drone technologies has built upon earlier military applications of these devices. Predicting the future of this technology will entail looking at its market potential across a variety of applications and considering the legal and cultural barriers that might slow adoption.",
        "NGSS (2013)": "HS-ETS1-4 Use a computer simulation to model the impact of proposed solutions to a complex real-world problem with numerous criteria and constraints on interactions within and between systems relevant to the problem.",
        "CCSS Math": "N-Q.1 Use units as a way to understand problems and to guide the solution of multi?step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays.",
        "CCSS ELA": "ELA-Literacy.RST.9-10.3 Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1Q",
        "Benchmark": "Conduct research to inform intentional inventions and innovations that address specific needs and wants",
        "Benchmark Detail": "Years of research led to the design and development of laser systems used in atmospheric studies and other applications (LiDAR or LADAR). This same type of laser system was then modified and reapplied to treat the buildup of plaque in the arteries through laser angioplasty (i.e., surgical repair of a blood vessel such as an artery).",
        "NGSS (2013)": "S-ETS1-1 Analyze a major global challenge to specify qualitative and quantitative criteria and constraints for solutions that account for societal need and wants.",
        "CCSS Math": "S-IC.2. Decide if a specified model is consistent with results from a given data-generating process, e.g., using simulation.",
        "CCSS ELA": "ELA-Literacy.W.9-10.7 Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 1 Nature and Characteristics of Technology and Engineering",
        "Benchmark Id": "STEL 1R",
        "Benchmark": "Develop a plan that incorporates knowledge from science, mathematics, and other disciplines to design or improve a technological product or system",
        "Benchmark Detail": "Designing, maintaining, and improving products or systems often require unique knowledge and skills. For example, a botanist could diagnose problems associated with crop growth, allowing an agricultural engineer to design a system for automating the care required for better crops, which in turn requires a technologist to provide maintenance and feedback on the system for maximum efficiency. These experts rely on collaboration to design, maintain, and improve products or systems.",
        "NGSS (2013)": "HS-ESS3-3 Create a computational simulation to illustrate the relationships among management of natural resources, the sustainability of human populations, and biodiversity",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RST.9-10.8 Assess the extent to which the reasoning and evidence in a text support the author's claim or a recommendation for solving a scientific or technical problem.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2A",
        "Benchmark": "Illustrate how systems have parts or components that work together to accomplish a goal",
        "Benchmark Detail": "For example, a bicycle can be thought of as a system. It has many parts, wheels, handlebars, pedals, brakes, gears, and chains, and each is important for the bicycle to function properly.",
        "NGSS (2013)": "2-PS1-3 Make observations to construct an evidence-based account of how an object made of a small set of pieces can be disassembled and made into a new object.",
        "CCSS Math": "1.MD.4 Organize, represent, and interpret data with up to three categories; ask and answer questions about the total number of data points.",
        "CCSS ELA": "",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2B",
        "Benchmark": "Safely use tools to complete tasks",
        "Benchmark Detail": "Many tools have specific functions and selecting the right tool makes the task easier. People use tools to make objects, to achieve a desired outcome, and to communicate. Children use scissors to cut paper, glue sticks to fasten components together, markers to sketch ideas, and computers to search for information.",
        "NGSS (2013)": "",
        "CCSS Math": "2.MD.1 Measure the length of an object by selecting and using appropriate tools such as rulers, yardsticks, meter sticks, and measuring tapes",
        "CCSS ELA": "",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2C",
        "Benchmark": "Explain that materials are selected for use because they possess desirable properties and characteristics",
        "Benchmark Detail": "Paper, wood, cloth, cardboard, and found objects are the most common materials young children use in making the items they design. By working with materials, they learn through observation and testing which materials perform better for given tasks.",
        "NGSS (2013)": "2-PS1-2 Analyze data obtained from testing different materials to determine which materials have properties that are best suited for their intended purpose.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.2.3 Describe the connection between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2D",
        "Benchmark": "Develop a plan in order to complete a task",
        "Benchmark Detail": "For example, young children learn that if they want to accomplish something, such as design and make a birthday card for a parent, they must have the materials available, and they must have the card ready by a given date.",
        "NGSS (2013)": "K-2-ETS1-2. Develop a simple sketch, drawing, or physical model to illustrate how the shape of an object helps it function as needed to solve a given problem.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.SL.1.5 Add drawings or other visual displays to descriptions when appropriate to clarify ideas, thoughts, and feelings.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2E",
        "Benchmark": "Collaborate effectively as a member of a team",
        "Benchmark Detail": "To operate at the most effective level, team members must learn to communicate and work together as a unit. Strategies to work together in a team must be modeled by the teacher and laid out as an expectation within the laboratory-classroom setting.",
        "NGSS (2013)": "",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.SL.1.1.b Build on others' talk in conversations by responding to the comments of others through multiple exchanges.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2F",
        "Benchmark": "Describe how a subsystem is a system that operates as a part of another larger system",
        "Benchmark Detail": "An example of a subsystem is the assemblage of water pipes in a house, which is part of a larger fresh-water distribution system in a town, city, or community.",
        "NGSS (2013)": "",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.W.4.7 Conduct short research projects that build knowledge through investigation of different aspects of a topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2G",
        "Benchmark": "Illustrate how, when parts of a system are missing, it may not work as planned",
        "Benchmark Detail": "A computer does not work when the power fails or when the battery has been removed.",
        "NGSS (2013)": "3-5-ETS1.A Possible solutions to a problem are limited by available materials and resources (constraints).",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.W.5.1.b Provide logically ordered reasons that are supported by facts and details.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2H",
        "Benchmark": "Identify the resources needed to get a technical job done, such as people, materials, capital, tools, machines, knowledge, energy, and time",
        "Benchmark Detail": "Elementary students involved in problem-solving activities such as Odyssey of the Mind need to develop a list of resources that they will need for a play they must perform in front of judges. Strategic planning of resources might include the backdrop, costumes, props, what roles the team members will play, and a consideration of deadlines.",
        "NGSS (2013)": "3-5 ETS 1-1. Define a simple design problem reflecting a need or a want that includes specified criteria for success and constraints on materials, time, or cost.",
        "CCSS Math": "5.NF.6. Solve real world problems involving multiplication of fractions and mixed numbers, e.g., by using visual fraction models or equations to represent the problem",
        "CCSS ELA": "ELA-Literacy W.5.8 Recall relevant information from experiences or gather relevant information from print and digital sources; summarize or paraphrase information in notes and finished work, and provide a list of sources.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2I",
        "Benchmark": "Describe the properties of different materials",
        "Benchmark Detail": "Students should understand the difference between natural and human-made materials and their basic properties. For example, wood, stone, metal, glass, and concrete are hard and dense; leather, paper, and some metals are flexible; glass and some plastics are transparent. Some materials conduct heat and electricity while others insulate to stop or delay transmission of heat or electricity. The properties of a specific material determine whether it is suitable for a given application.",
        "NGSS (2013)": "5-PS1-3 Make observations to identify materials based on their properties.",
        "CCSS Math": "4.MD.2 Use the four operations to solve word problems involving distances, intervals of time, liquid volumes, masses of objects, and money",
        "CCSS ELA": "ELA-Literacy W.4.2.b Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2J",
        "Benchmark": "Demonstrate how tools and machines extend human capabilities, such as holding, lifting, carrying, fastening, separating, and computing",
        "Benchmark Detail": "The use of tools and machines, such as glue guns, mini-saws, rulers, scissors, gears, clamps, and computers, makes it possible for people to accomplish more tasks.",
        "NGSS (2013)": "ETS1.B: Developing Possible Solutions & Research on a problem should be carried out before beginning to design a solution. Testing a solution involves investigating how well it performs under a range of likely conditions.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.W.5.2.b Develop the topic with facts, definitions, concrete details, quotations, or other information and examples related to the topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2K",
        "Benchmark": "Describe requirements of designing or making a product or system",
        "Benchmark Detail": "Requirements are the criteria or expected outcomes we use when designing. For example, it is often impossible to make a product in a certain way because of the cost of materials or because of time constraints, such as needing the product to be made more quickly than is possible with the method in question. These limits are considered in making decisions about designing and making a product.",
        "NGSS (2013)": "3-5 ETS1.A. The success of a designed solution is determined by considering the desired features of a solution (criteria).",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.4.3 Explain events, procedures, ideas, or concepts in a historical, scientific, or technical text, including what happened and why, based on specific information in the text.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2L",
        "Benchmark": "Create a new product that improves someone's life",
        "Benchmark Detail": "Inventions are created to fulfill a human need or want. Inventions are the way that humans attempt to improve upon the natural world. Identifying various products that have helped people with disabilities, such as ITEEA's 'Dream Ride GoBabyGo Style' initiative, is a good starting point for helping students find needs and consider innovative ways of meeting those needs.",
        "NGSS (2013)": "3-5-ETS1-2. Generate and compare multiple possible solutions to a problem based on how well each is likely to meet the criteria and constraints of the problem.",
        "CCSS Math": "5.NF.6. Solve real world problems involving multiplication of fractions and mixed numbers, e.g., by using visual fraction models or equations to represent the problem.",
        "CCSS ELA": "ELA-Literacy.W.4.7 Conduct short research projects that build knowledge through investigation of different aspects of a topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2M",
        "Benchmark": "Differentiate between inputs, processes, outputs, and feedback in technological systems",
        "Benchmark Detail": "Inputs consist of the resources that flow into a technological system. The processes are the systematic sequences of actions that combine resources to produce an output, encoding, reproducing, designing, assembling, or propagating, for example. The output is the result, which can have both positive or negative impacts. Feedback is information used to monitor or control a system. A system often includes a component that permits revising or refining the system when the feedback suggests such action. For example, the fuel level indicator of a vehicle is a feedback system that lets the user know when the system needs additional fuel.",
        "NGSS (2013)": "MS-ETS1-2. Evaluate competing design solutions using a systematic process to determine how well they meet the criteria and constraints of the problem.",
        "CCSS Math": "6.SP.5 Summarize numerical data sets in relation to their context.",
        "CCSS ELA": "ELA-Literacy.SL.6.2 Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2N",
        "Benchmark": "Illustrate how systems thinking involves considering relationships between every part, as well as how the system interacts with the environment in which it is used",
        "Benchmark Detail": "Systems are used in a number of ways. Systems also appear in many aspects of daily life, such as communication systems and transportation systems. Analyzing a system is done in terms of its individual parts or in terms of the whole system and how it interacts with or relates to other systems. For example, discussing a computer system may involve the particular parts of a single computer, or it may include an entire computer network. Discussing a transportation system may involve listing the various parts of a particular form of transport (e.g., airports, airplanes, air traffic control, airport security, etc.), or it may be discussed by comparing the overall attributes of one type of transportation system to another (e.g., the type of vehicles used, energy inputs, control mechanisms, and so on)",
        "NGSS (2013)": "ETS1.B: Developing Possible Solutions: Sometimes parts of different solutions can be combined to create a solution that is better than any of its predecessors.",
        "CCSS Math": "6.RP.3 Use ratio and rate reasoning to solve real-world and mathematical problems, e.g., by reasoning about tables of equivalent ratios, tape diagrams, double number line diagrams, or equations.",
        "CCSS ELA": "ELA-Literacy.W.7.7 Conduct short research projects to answer a question, drawing on several sources and generating additional related, focused questions for further research and investigation.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2O",
        "Benchmark": "Create an open-loop system that has no feedback path and requires human intervention",
        "Benchmark Detail": "An example of an open-loop system is a light switch in a room. The electrical system has no feedback loop but requires someone to flip the switch (input) to send electrons to the bulb (process) and make light illuminate the room (output).",
        "NGSS (2013)": "MS-LS2-4 Construct an argument supported by empirical evidence that changes to physical or biological components of an ecosystem affect populations.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.7.8 Trace and evaluate the argument and specific claims in a text, assessing whether the reasoning is sound and the evidence is relevant and sufficient to support the claims",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2P",
        "Benchmark": "Create a closed-loop system that has a feedback path and requires no human intervention",
        "Benchmark Detail": "Systems can be designed to utilize automated controls that both receive information from the system and take action based on the content of that feedback. An example is the water heater in a home, which has a thermostat to provide feedback and automatically adjusts the system when it needs to be turned on and off.",
        "NGSS (2013)": "ETS1.B: Developing Possible Solutions: There are systematic processes for evaluating solutions with respect to how well they meet the criteria and constraints of a problem.",
        "CCSS Math": "",
        "CCSS ELA": "",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2Q",
        "Benchmark": "Predict outcomes of a future product or system at the beginning of the design process",
        "Benchmark Detail": "Careful designers should consider possible outcomes of a technological product before the product is completed. This is a habit of mind that students should continually expand through design, problem solving, ideation, and systems thinking.",
        "NGSS (2013)": "ETS1.C The iterative process of testing the most promising solutions and modifying what is proposed on the basis of the test results leads to greater refinement and ultimately an optimal solution",
        "CCSS Math": "6.SP.5 Summarize numerical data sets in relation to their context.",
        "CCSS ELA": "ELA-Literacy.W.8.7 Conduct short research projects to answer a question (including a self-generated question), drawing on several sources and generating additional related, focused questions that allow for multiple avenues of exploration.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2R",
        "Benchmark": "Compare how different technologies involve different sets of processes",
        "Benchmark Detail": "For example, data processing includes designing, summarizing, storing, retrieving, reproducing, evaluating, and communicating information. The processes of construction include designing, developing, evaluating, making and producing, marketing, and managing.",
        "NGSS (2013)": "ETS1.B: Developing Possible Solutions There are systematic processes for evaluating solutions with respect to how well they meet the criteria and constraints of a problem.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy RST.6-8.9 Compare and contrast the information gained from experiments, simulations, video, or multimedia sources with that gained from reading a text on the same topic.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2S",
        "Benchmark": "Defend decisions related to a design problem",
        "Benchmark Detail": "By requiring students to defend their actions and communicate their findings after attempting to solve a problem, students develop empathy, flexible thinking, accountability, and metacognition skills (i.e., awareness and understanding of their own thought processes). Helping students develop technology and engineering habits of mind involves the teacher explicitly modeling, teaching, and providing students opportunities to demonstrate expected behaviors.",
        "NGSS (2013)": "MS-LS2-4. Construct an argument supported by empirical evidence that changes to physical or biological components of an ecosystem affect populations.",
        "CCSS Math": "7.SP.2 Use data from a random sample to draw inferences about a population with an unknown characteristic of interest.",
        "CCSS ELA": "ELA-Literacy.SL.7.2 Analyze the main ideas and supporting details presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how the ideas clarify a topic, text, or issue under study.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2T",
        "Benchmark": "Demonstrate the use of conceptual, graphical, virtual, mathematical, and physical modeling to identify conficting considerations before the entire system is developed and to aid in design decision making",
        "Benchmark Detail": "Systems thinking applies critical thinking and creativity with informed compromises to complex, real-life problems.",
        "NGSS (2013)": "HS-ETS1-1. Analyze a major global challenge to specify qualitative and quantitative criteria and constraints for solutions that account for societal needs and wants",
        "CCSS Math": "N-Q.1 Use units as a way to understand problems and to guide the solution of multi?step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays.",
        "CCSS ELA": "ELA-Literacy RI.11-12.7 Integrate and evaluate multiple sources of information presented in different media or formats (e.g., visually, quantitatively) as well as in words in order to address a question or solve.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2U",
        "Benchmark": "Diagnose a flawed system embedded within a larger technological, social, or environmental system",
        "Benchmark Detail": "Systems are made up of components (i.e., subsystems). A food processor is only one component in a larger food preparation system that, in turn, is a component in a larger home system. Troubleshooting a flawed system or product allows students to identify possible areas for improvement. For example, a recycling program at their school might have very low participation rates by students and staff members. Investigating the components of the program (system) will help students identify ways to improve it.",
        "NGSS (2013)": "HS-ESS3-3. Create a computational simulation to illustrate the relationships among management of natural resources, the sustainability of human populations, and biodiversity.",
        "CCSS Math": "S-IC.2. Decide if a specified model is consistent with results from a given data?generating process, e.g., using simulation.",
        "CCSS ELA": "ELA-Literacy.W.9-10.7 Conduct short as well as more sustained research projects to answer a question (including a self-generated question) or solve a problem; narrow or broaden the inquiry when appropriate; synthesize multiple sources on the subject, demonstrating understanding of the subject under investigation.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2V",
        "Benchmark": "Analyze the stability of a technological system and how it is influenced by all of the components in the system, especially those in the feedback loop",
        "Benchmark Detail": "Automated control systems in a vehicle, for example, automatically detect and control the speed of the vehicle.",
        "NGSS (2013)": "ETS1.C: Optimizing the Design Solution: Criteria may need to be broken down into simpler ones that can be approached systematically, and decisions about the priority of certain criteria over others (trade-offs) may be needed.",
        "CCSS Math": "S-IC.6 Evaluate reports based on data.",
        "CCSS ELA": "ELA-Literacy.RST.9-10.8 Assess the extent to which the reasoning and evidence in a text support the author's claim or a recommendation for solving a scientific or technical problem",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2W",
        "Benchmark": "Select resources that involve tradeoffs between competing values, such as availability, cost, desirability, and waste while solving problems",
        "Benchmark Detail": "Technological development involves decisions about which resources can and should be used. For example, some homes are very energy efficient, while others consume large amounts of energy due to the selection of materials and appliances and the construction methods used.",
        "NGSS (2013)": "HS-ETS1-2. Criteria may need to be broken down into simpler ones that can be approached systematically, and decisions about the priority of certain criteria over others (trade-offs) may be needed",
        "CCSS Math": "N-Q.1 Use units as a way to understand problems and to guide the solution of multi?step problems; choose and interpret units consistently in formulas; choose and interpret the scale and the origin in graphs and data displays.",
        "CCSS ELA": "ELA-Literacy.RST.9-10.1 Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2X",
        "Benchmark": "Cite examples of the criteria and constraints of a product or system and how they affect final design",
        "Benchmark Detail": "Sometimes requirements can be constraints, criteria, or both. Consideration and management of these requirements are essential in design. For example, online retailers have had to consider the promise of fast home delivery (criteria) with the constraint of distribution center locations in last-mile delivery systems.",
        "NGSS (2013)": "HSETS1-3. When evaluating solutions, it is important to take into account a range of constraints, including cost, safety, reliability, and aesthetics, and to consider social, cultural, and environmental impacts",
        "CCSS Math": "N-Q. 3 Choose a level of accuracy appropriate to limitations on measurement when reporting quantities.",
        "CCSS ELA": "ELA-Literacy RST. 9-10.1 Cite specific textual evidence to support analysis of science and technical texts, attending to the precise details of explanations or descriptions.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2Y",
        "Benchmark": "Implement quality control as a planned process to ensure that a product, service, or system meets established criteria",
        "Benchmark Detail": "Quality control is concerned with how well a product, service, or system conforms to specifications and tolerances required by the design. For example, a set of rigorous international standards has been established to help companies systematically increase the quality of their products and operations. As consumers, we rely on quality control in manufacture of the products we purchase and use as a way of protecting the investment we make.",
        "NGSS (2013)": "HS-ESS3-4. Evaluate or refine a technological solution that reduces impacts of human activities on natural systems.",
        "CCSS Math": "S-IC.2. Decide if a specified model is consistent with results from a given data?generating process, e.g. using simulation.",
        "CCSS ELA": "ELA-Literacy.RST.9-10.3 Follow precisely a complex multistep procedure when carrying out experiments, taking measurements, or performing technical tasks, attending to special cases or exceptions defined in the text.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 2 Core Concepts of Technology and Engineering",
        "Benchmark Id": "STEL 2Z",
        "Benchmark": "Use management processes in planning, organizing, and controlling work",
        "Benchmark Detail": "Management is sometimes defined as getting work done through other people. Teamwork, responsibility, and interpersonal dynamics play a significant role in the development and production of technological products. Management processes are used to oversee and guide these functions.",
        "NGSS (2013)": "ETS1.A: Defining and Delimiting Engineering Problems: Criteria and constraints also include satisfying any requirements set by society, such as taking issues of risk mitigation into account, and they should be quantified to the extent possible and stated in such a way that one can tell if a given design meets them.",
        "CCSS Math": "S-IC.6 Evaluate reports based on data.",
        "CCSS ELA": "ELA-Literacy SL.9-10.1.d Respond thoughtfully to diverse perspectives, summarize points of agreement and disagreement, and, when warranted, qualify or justify their own views and understanding and make new connections in light of evidence and reasoning presented.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3A",
        "Benchmark": "Apply concepts and skills from technology and engineering activities that reinforce concepts and skills across multiple content areas",
        "Benchmark Detail": "Young children can use building blocks to develop computational and critical-thinking skills by introducing design, measurement, and structural concepts. The intentional translation of skills learned in physical education, such as teamwork, can be applied to problem solving. Drawing in art class can lead to new ways of thinking about design and visual appeal.",
        "NGSS (2013)": "K-2-ETS1-1. Ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through the development of a new or improved object or tool.",
        "CCSS Math": "2.MD.10 Draw a picture graph and bar graph (with single-unit scale) to represent a data set with up to four categories. Solve simple put-together, take-apart, and compare problems using information presented in a bar graph",
        "CCSS ELA": "ELA-Literacy.SL.1.4 Describe people, places, things, and events with relevant details, expressing ideas and feelings clearly.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3B",
        "Benchmark": "Draw connections between technology and human experiences",
        "Benchmark Detail": "Young children learn to count through nursery rhymes and playing with manipulatives. Children's books often include graphics and some even generate sound. Teachers can have students identify technological connections from their homes, traveling in vehicles, and other experiences, and through this help young students understand the role of technology in their lives.",
        "NGSS (2013)": "2-PS1-3  Make observations to construct an evidence-based account of how an object made of a small set of pieces can be disassembled and made into a new object.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.2.3 Describe the connection between a series of historical events, scientific ideas or concepts, or steps in technical procedures in a text.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3C",
        "Benchmark": "Demonstrate how simple technologies are often combined to form more complex systems",
        "Benchmark Detail": "Students could construct a small robot to demonstrate simple circuits using wires, a motor, and a power source (battery). Another example would be how an escalator uses the wheel and axle, inclined plane, pulley, gears, belts, and an electric motor to move people from one level to another.",
        "NGSS (2013)": "ETS1.C: Optimizing the Design Solution: Different solutions need to be tested in order to determine which of them best solves the problem, given the criteria and the constraints",
        "CCSS Math": "4.MD.2 Use four operations to solve word problems involving distances, intervals of time, liquid, volumes, masses of objects, and money, including problems involving simple fractions or decimals, and problems that require expressing measurements given in a larger unit in terms of a smaller unit.",
        "CCSS ELA": "",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3D",
        "Benchmark": "Explain how various relationships can exist between technology and engineering and other content areas",
        "Benchmark Detail": "Students can learn how to convert energy from the wind to power a motor or from acidic fruits such as oranges and grapefruits to energize an LED light. This type of project uses information from mathematics, science, and other fields to develop a deeper understanding among students about technology and engineering products and systems.",
        "NGSS (2013)": "3-5-ETS1-2. Generate and compare multiple possible solutions to a problem based on how well each is likely to meet the criteria and constraints of the problem.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RI.5.3 Explain the relationships or interactions between two or more individuals, events, ideas, or concepts in a historical, scientific, or technical text based on specific information in the text.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3E",
        "Benchmark": "Analyze how different technological systems often interact with economic, environmental, and social systems",
        "Benchmark Detail": "For example, a navigation system in a delivery vehicle uses sensors that provide input to the distribution center and sends customers notifications when their products are delivered. If a package is delivered to a wrong address, GPS data can accurately determine the location to which the package was actually delivered",
        "NGSS (2013)": "ETS1.C Although one design may not perform the best across all tests, identifying the characteristics of the design that performed the best in each test can provide useful information for the redesign process - that is, some of these characteristics may be incorporated into the new design.",
        "CCSS Math": "6.SP.1 Recognize a statistical question as one that anticipates variability in the data related to the question and accounts for it in the answers.",
        "CCSS ELA": "ELA-Literacy SL.6.2 Interpret information presented in diverse media and formats (e.g., visually, quantitatively, orally) and explain how it contributes to a topic, text, or issue under study.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3F",
        "Benchmark": "Apply a product, system or process developed for one setting to another setting",
        "Benchmark Detail": "Technology transfer is a creative way for people to address needs and wants. For instance, an automated pump based on biology laboratory designs was created for the Mars Viking space probe. The pump was modified for use as an insulin delivery mechanism, providing patients with a way to automatically regulate blood sugar",
        "NGSS (2013)": "MS-ESS3-3 Apply scientific principles to design a method for monitoring ad minimizing a human impact on the environment.",
        "CCSS Math": "7.SP.7 Develop a probability model and use it to find probabilities of events. Compare probabilities from a model to observed frequencies; if the agreement is not good, explain possible sources of the discrepancy.",
        "CCSS ELA": "ELA-Literacy.W.7.1 Write arguments to support claims with clear reasons and relevant evidence.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "6-8",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3G",
        "Benchmark": "Explain how knowledge gained from other content areas affects the development of technological objects and systems",
        "Benchmark Detail": "For example, skills learned in fine arts are used in designing and rendering examples of technological products and systems. Studying the history of technology and engineering provides people with a way to learn from past successes and challenges.",
        "NGSS (2013)": "ETS1.C: Optimizing the Design Solution: The iterative process of testing the most promising solutions and modifying what is proposed on the basis of the test results leads to greater refinement and ultimately to an optimal solution.",
        "CCSS Math": "6.SP.5 Summarize numerical data sets in relation to their context.",
        "CCSS ELA": "ELA-Literacy.W.8.9 Draw evidence from literary or informational texts to support analysis, reflection, and research.",
        "System Thinking": "Uses the systems model to show how parts of technological systems work together",
        "Creativity": "Exhibits innovative and original ideas in the context of design-based activities",
        "Making and Doing": "Exhibits safe, effective ways of producing technological products, systems, and processes",
        "Critical Thinking": "Defends technological decisions based on evidence",
        "Optimism": "Critiques technological products and systems to identify areas of improvement",
        "Collaboration": "Demonstrates productive teamwork in design-based projects",
        "Communication": "Exhibits effective technical writing, graphic, and oral communication abilities",
        "Ethics": "Shows an understanding of ways to regulate technologies and the reasons for doing so"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3H",
        "Benchmark": "Analyze how technology transfer occurs when a user applies an existing innovation developed for one function for a different purpose",
        "Benchmark Detail": "For example, aerospace composite materials were used to design an advanced, lightweight, and easy-to-maneuver wheelchair.",
        "NGSS (2013)": "HS-PS3-3 Design, build, and refine a device that works within given constraints to convert on form of energy into another form of energy",
        "CCSS Math": "S-MD.7. Analyze decisions and strategies using probability concepts (e.g., product testing, medical testing, pulling a hockey goalie at the end of a game).",
        "CCSS ELA": "ELA-Literacy W.9-10.2 Write informative/explanatory texts to examine and convey complex ideas, concepts, and information clearly and accurately through the effective selection, organization, and analysis of content",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3I",
        "Benchmark": "Evaluate how technology enhances opportunities for new products and services through globalization",
        "Benchmark Detail": "Developing countries have in many cases bypassed telephone landlines in adopting cellular technology, which has been used not just for communication but also to complete a variety of other tasks, such as banking. This concept is referred to as late-comer advantage.",
        "NGSS (2013)": "HS-ETS1-1. Analyze a major global challenge to specify qualitative and quantitative criteria and constraints for solutions that account for societal needs and wants.",
        "CCSS Math": "S-IC.6 Evaluate reports based on data.",
        "CCSS ELA": "ELA-Literacy.W.8.9 Draw evidence from literary or informational texts to support analysis, reflection, and research.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "9-12",
        "Disciplinary Standard": "STEL 3 Integration of Knowledge, Technologies, and Practices ",
        "Benchmark Id": "STEL 3J",
        "Benchmark": "Connect technological progress to the advancement of other areas of knowledge",
        "Benchmark Detail": "For instance, cloud data storage aided the connectivity of physical devices, known as the internet of things (IoT). This advancement has enabled real-time mathematical, economic, medical, and other applications of data collection, analysis, and production. The increased speed of statistical analysis through computer processors is powering technological innovations.",
        "NGSS (2013)": "ETS1.A: Defining and Delimiting Engineering Problems: Criteria and constraints also include satisfying any requirements set by society, such as taking issues of risk mitigation into account, and they should be quantified to the extent possible and stated in such a way that one can tell if a given design meets them.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.RST.6-8.1 Cite specific textual evidence to support analysis of science and technical texts.",
        "System Thinking": "Designs and troubleshoots technological systems in ways that consider the multiple components of the system",
        "Creativity": "Elaborates and articulates novel ideas and aesthetics",
        "Making and Doing": "Demonstrates the ability to regulate and improve making and doing skills",
        "Critical Thinking": "Uses evidence to better understand and solve problems in technology and engineering, including applying computational thinking",
        "Optimism": "Shows persistence in addressing technological problems and finding solutions to those problems",
        "Collaboration": "Considers and accommodates teammate skills and abilities when working to achieve design and problem solving goals",
        "Communication": "Conveys ideas clearly in constructive, insightful ways, including through written and oral communication and via mathematical and physical models",
        "Ethics": "Assesses technological products, systems, and processes through critical analysis of their impacts and outcomes"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4A",
        "Benchmark": "Explain ways that technology helps with everyday tasks",
        "Benchmark Detail": "Children should be able to identify activities they engage in regularly and describe how different technologies help them do these tasks more easily. Contrasting the lifestyles of earlier societies with their own will provide ample examples.",
        "NGSS (2013)": "K-2-ETS1-1. Ask questions, make observations, and gather information about a situation people want to change to define a simple problem that can be solved through the development of a new or improved object or tool.",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.W.K.2 Use a combination of drawing, dictating, and writing to compose informative explanatory texts in which they name what they are writing about and supply some information about the topic.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4B",
        "Benchmark": "Illustrate helpful and harmful effects of technology",
        "Benchmark Detail": "Children can examine a familiar technology and explain how it can be both helpful and harmful. For example, a crayon can be used to draw creatively but can also be used to write on bedroom walls.",
        "NGSS (2013)": "2-PS1-2 Analyze data obtained from testing different materials to determine which materials have properties that are best suited for their intended purpose.",
        "CCSS Math": "1.G.1 Distinguish between defining attributes versus non?defining attributes; build and draw shapes to possess defining attributes.",
        "CCSS ELA": "ELA-Literacy.RL.2.1 Ask and answer such questions as who, what, where, when, why, and how to demonstrate understanding of key details in a text.",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4C",
        "Benchmark": "Compare simple technologies to evaluate their impacts",
        "Benchmark Detail": "Given a basic task, children can decide what tool to use to complete the task. In helping to clean the classroom after an activity, a student would need to select different tools to clean the floor, desktops, or walls.",
        "NGSS (2013)": "K-2-ETS1-3. Analyze data from tests of two objects designed to solve the same problem to compare the strengths and weaknesses of how each performs.",
        "CCSS Math": "K.MD.2. Directly compare two objects with a measurable attribute in common, to see which object has more of/less of the attribute, and describe the difference.",
        "CCSS ELA": "",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4D",
        "Benchmark": "Select ways to reduce, reuse, and recycle resources in daily life",
        "Benchmark Detail": "Children should give examples of the ways they handle waste at school or at home.",
        "NGSS (2013)": "K-ESS3-3 Communicate solutions that will reduce the impact of humans on land, water, air, and/or other living things in the local environment",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.L.1.5.c Identify real-life connections between words and their use (e.g., note places at home that are cozy).",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "Pre-K-2",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4E",
        "Benchmark": "Design new technologies that could improve their daily lives",
        "Benchmark Detail": "Children can brainstorm needs or wants and devise possible solutions to meet a need. Teachers and parents can pose what if? questions to young children. What if you and your friends could build something in the school's playground to make recess more fun? What would you build?'",
        "NGSS (2013)": "ETS1.A: Defining and Delimiting Engineering Problems: A situation that people want to change or create can be approached as a problem to be solved through engineering. (K- 2-ETS1-1)",
        "CCSS Math": "",
        "CCSS ELA": "",
        "System Thinking": "Learns that human designed things are connected",
        "Creativity": "Learns that humans create products and ways of doing things",
        "Making and Doing": "Learns to use tools and materials to accomplish a task",
        "Critical Thinking": "Engages in listening, questioning, and discussing",
        "Optimism": "Sees opportunities for making technologies better",
        "Collaboration": "Learns to share technological products and ideas",
        "Communication": "Learns that humans have many ways to communicate",
        "Ethics": "Learns that use of technology affects humans and the environment"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4F",
        "Benchmark": "Describe the helpful and harmful effects of technology",
        "Benchmark Detail": "Students can begin to explore more fully the idea of intended, unintended, positive, and negative outcomes inherent in technologies. Students at this age learn how their own lives have been impacted through technology and how technological processes generate undesirable waste and emissions.",
        "NGSS (2013)": "ETS1.B: Developing Possible Solutions: Research on a problem should be carried out before beginning to design a solution. Testing a solution involves investigating how well it performs under a range of likely conditions. (3-5- ETS1-2)",
        "CCSS Math": "",
        "CCSS ELA": "ELA-Literacy.SL.3.2 Determine the main ideas and supporting details of a text read aloud or information presented in diverse media and formats, including visually, quantitatively, and orally.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4G",
        "Benchmark": "Judge technologies to determine the best one to use to complete a given task or meet a need",
        "Benchmark Detail": "Through exposure to the function and use of various age-appropriate tools/technologies, students can determine which tools are best for a given task and can explain their selection.",
        "NGSS (2013)": "3-5-ETS1-2. Generate and compare multiple possible solutions to a problem based on how well each is likely to meet the criteria and constraints of the problem.",
        "CCSS Math": "4.OA.3 Solve multistep word problems posed with whole numbers and having whole-number answers using the four operations, including problems in which remainders must be interpreted. Represent these problems using equations with a letter standing for the unknown quantity. Assess the reasonableness of answers using mental computation and estimation strategies including rounding.",
        "CCSS ELA": "ELA-Literacy.W.3.7 Conduct short research projects that build knowledge about a topic.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    },
    {
        "Grade Level": "3-5",
        "Disciplinary Standard": "STEL 4 Impacts of Technology",
        "Benchmark Id": "STEL 4H",
        "Benchmark": "Classify resources used to create technologies as either renewable or non-renewable",
        "Benchmark Detail": "An introduction to material resources and how they are recovered will help students understand the concept of renewability and its importance and can be tied to concepts they learn in science.",
        "NGSS (2013)": "ETS1.A: Defining and Delimiting Engineering Problems: Possible solutions to a problem are limited by available materials and resources (constraints).",
        "CCSS Math": "5.G.4 Classify two-dimensional figures in a hierarchy based on properties.",
        "CCSS ELA": "ELA-Literacy.W.5.1.b Provide logically ordered reasons that are supported by facts and details.",
        "System Thinking": "Provides examples of how human designed products are connected",
        "Creativity": "Tries new technologies and generates strategies for improving existing ideas",
        "Making and Doing": "Safely uses grade appropriate tools, materials, and processes to build projects",
        "Critical Thinking": "Knows how to find answers to technological questions",
        "Optimism": "Engages in 'tinkering' to improve a design",
        "Collaboration": "Works in small groups to complete design-based projects",
        "Communication": "Develops written and oral communication skills",
        "Ethics": "Explains ethical dilemmas involving technology, such as trade offs"
    }
]
